In[4]:=
x^3 + (3x^2 + 7)(4x-1)+(2x-3)^4 //Expand


Out[4]= 74-188 x+213 x^2-83 x^3+16 x^4
In[7]:= 
(x+y)^3 //Expand
Out[7]= x^3+3 x^2 y+3 x y^2+y^3
In[10]:= 
(*Cociente y resto de polinomios*)

c=PolynomialQuotient[x^3+5x^2-3x+2, 4x-3,x]
Out[10]= 21/64+(23 x)/16+x^2/4
In[11]:= 
r = PolynomialRemainder[x^3+5x^2-3x+2, 4x-3,x]
Out[11]= 191/64
In[12]:= (*Esta función genera los dos*)
PolynomialQuotientRemainder[x^3+5x^2-3x+2, 4x-3,x]
Out[12]= {21/64+(23 x)/16+x^2/4,191/64}

(4x-3)*c + r //Expand (*Comprobación de la división*)
Out[13]= 2-3 x+5 x^2+x^3
In[15]:= 
(* Factorización de polinomios *)
p = x^4 - x^3 - 7x^2+13x-6
Out[15]= -6+13 x-7 x^2-x^3+x^4
In[16]:= Factor[p]
Out[16]= (-2+x) (-1+x)^2 (3+x)

(*Mathematica no factoriza a veces como queremos polinomios con raices irracionales*)

q = x^3+x^2-2x-2
Factor[q]
In[29]:= -2-2 x+x^2+x^3
In[31]:= -2-2 x+x^2+x^3
Out[31]= -2-2 x+x^2+x^3
In[32]:= 
q2 = x^3+x^2-2x-2.
Factor[q2]
Out[32]= -2.-2 x+x^2+x^3
Out[33]= 1. (-1.41421+1. x) (1. +1. x) (1.41421 +1. x)
In[30]:= -2.`-2 x+x^2+x^3
Out[30]= -2.-2 x+x^2+x^3

(*Para factorizar sobre los complejos con parte imaginaria y real entera hay que activar la opción GaussianIntegers *)
Factor[x^3+3x^2+x+3] (* desactivado*)
Out[34]= (3+x) (1+x^2)
In[36]:= Factor[x^3+3x^2+x+3, GaussianIntegers->True]
(* activado*)
Out[36]= (-I+x) (I+x) (3+x)